{"format": "graph-model", "generatedBy": "1.12.0", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"node": [{"name": "dnn/head/AsString", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Encoder_en/DNN/ResidualHidden_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Encoder_en/DNN/ResidualHidden_3/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Encoder_en/DNN/ResidualHidden_0/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Encoder_en/DNN/ResidualHidden_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Embeddings_en/sharded_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "47060"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Encoder_en/DNN/embedding_lookup_sparse/embedding_lookup/floordiv/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/string_to_index/hash_table/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/boolean_mask/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/string_to_index/hash_table", "op": "HashTableV2", "attr": {"shared_name": {"s": ""}, "use_node_name_sharing": {"b": false}, "key_dtype": {"type": "DT_STRING"}, "value_dtype": {"type": "DT_INT64"}, "container": {"s": ""}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "dnn/head/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/StringJoin/inputs_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "ParseExample/ParseExample/dense_keys_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "ParseExample/ParseExample/names", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{}]}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Encoder_en/DNN/embedding_lookup_sparse/embedding_lookup/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_1/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_1/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_2/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_2/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_3/pattern", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_3/rewrite", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_4/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_4/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_5/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_5/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_6/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_6/rewrite", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_7/pattern", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_7/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_8/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_8/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_9/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_9/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_10/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_10/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_11/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_11/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_12/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_12/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_13/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_13/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_14/pattern", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_14/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_15/pattern", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_15/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_16/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_16/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_17/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_17/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_18/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_18/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_19/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_19/rewrite", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_20/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_20/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_21/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_21/rewrite", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_22/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_22/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_23/pattern", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_23/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_24/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_24/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_25/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_25/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_26/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/StringJoin/inputs_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace_1/rewrite", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/tokenize/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/head/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/head/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/RegexReplace/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/RegexReplace_1/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/RegexReplace_2/pattern", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Equal/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/compound_bigrams/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/Encoder_en/DNN/ResidualHidden_3/projection", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/head/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Encoder_en/hidden_layers/l2_normalize/Maximum/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "dnn/hiddenlayer_0/kernel/part_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/hiddenlayer_0/bias/part_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/hiddenlayer_1/kernel/part_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/hiddenlayer_1/bias/part_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dnn/logits/kernel/part_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}]}}}}}, {"name": "dnn/logits/bias/part_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_tensors", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/string_to_index_Lookup/hash_table_Size", "op": "LookupTableSizeV2", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module/string_to_index/hash_table"]}, {"name": "dnn/head/ExpandDims", "op": "ExpandDims", "input": ["dnn/head/AsString", "dnn/head/ExpandDims/dim"], "attr": {"T": {"type": "DT_STRING"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "ParseExample/ParseExample", "op": "ParseExample", "input": ["input_tensors", "ParseExample/ParseExample/names", "ParseExample/ParseExample/dense_keys_0", "ParseExample/ParseExample/names"], "attr": {"sparse_types": {"list": {}}, "dense_shapes": {"list": {"shape": [{"dim": [{"size": "1"}]}]}}, "Tdense": {"list": {"type": ["DT_STRING"]}}, "Ndense": {"i": "1"}, "Nsparse": {"i": "0"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/Reshape", "op": "Reshape", "input": ["ParseExample/ParseExample", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Encoder_en/DNN/embedding_lookup_sparse/embedding_lookup/Reshape/shape"], "attr": {"T": {"type": "DT_STRING"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/Reshape", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_1", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_1/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_1/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_2", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_1", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_2/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_2/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_3", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_2", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_3/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_3/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_4", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_3", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_4/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_4/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_5", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_4", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_5/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_5/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_6", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_5", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_6/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_6/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_7", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_6", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_7/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_7/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_8", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_7", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_8/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_8/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_9", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_8", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_9/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_9/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_10", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_9", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_10/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_10/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_11", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_10", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_11/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_11/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_12", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_11", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_12/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_12/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_13", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_12", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_13/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_13/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_14", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_13", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_14/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_14/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_15", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_14", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_15/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_15/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_16", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_15", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_16/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_16/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_17", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_16", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_17/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_17/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_18", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_17", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_18/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_18/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_19", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_18", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_19/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_19/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_20", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_19", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_20/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_20/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_21", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_20", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_21/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_21/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_22", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_21", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_22/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_22/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_23", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_22", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_23/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_23/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_24", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_23", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_24/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_24/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_25", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_24", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_25/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_25/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_26", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_25", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_26/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Equal/y"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/normalize/RegexReplace_26", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Equal/y"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Equal", "op": "Equal", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Equal/y", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/StringJoin", "op": "StringJoin", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/StringJoin/inputs_0", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/StringJoin/inputs_2"], "attr": {"N": {"i": "3"}, "separator": {"s": "IA=="}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Select", "op": "Select", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Equal", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/StringJoin"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace_1", "op": "RegexReplace", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Select", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace/pattern", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace_1/rewrite"], "attr": {"replace_global": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/tokenize/StringSplit", "op": "StringSplit", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/RegexReplace_1", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/tokenize/Const"], "attr": {"skip_empty": {"b": true}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/SparseFillEmptyRows/SparseFillEmptyRows", "op": "SparseFillEmptyRows", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/tokenize/StringSplit", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/tokenize/StringSplit:1", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/tokenize/StringSplit:2", "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Equal/y"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/Max", "op": "Max", "input": ["dnn/input_from_feature_columns/input_layer/name_hub_module_embedding/module_apply_default/SparseFillEmptyRows/SparseFillEmptyRows", "dnn/head/ExpandDims/dim"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT64"}}}, {"name": 